'''
Задание 14. По данным двух выборок нормального закона распределения
(первая – с дисперсией S1**2, вторая – с дисперсией S2**2) 
проверить гипотезу о равенстве средних значений при уровне значимости α (при конкурирующей гипотезе об их неравенстве).
В ответе привести:
    1) выборочное среднее для первой выборки;
    2) выборочное среднее для второй выборки;
    3) вычисленное значение критерия;
    4) критическое значение;
    5) вывод о принятии или не принятии гипотезы.
'''

x = [ 59.1, 51.8, 40.7, 51.1, 41.1, 83.4, 79.3, 58.7, 55.4, 77.2, 74.5, 18.4,
    62.2, 42.6, 85.1, 64.7, 73.9, 59.1, 84.6, 63.2, 46.0, 62.9, 59.3, 97.4,
    72.7, 29.2, 80.1, 75.8, 83.8, 49.6, 95.8, 52.1, 82.3, 77.8, 52.6, 46.8,
    48.5, 63.1, 62.7, 35.2, 101.7, 55.7, 65.9, 66.7, 37.4, 49.3, 46.3, 86.8,
    15.0, 31.4, 82.7, 76.8, 81.7, 54.1, 59.2, 56.1, 55.9, 76.5, 75.9, 48.9,
    14.6, 43.1, 62.2, 72.4, 73.0, 78.7, 63.0, 75.8, 46.8, 61.4, 53.3, 60.1,
    35.8, 101.7, 57.5, 24.5, 79.7, 66.9, 40.6, 37.0, 62.3, 87.8, 75.9, 56.3,
    87.6, 69.1, 42.2, 58.2, 65.7, 65.1, 61.7, 51.1, 47.3, 87.4, 44.6, 8.8, 45.3,
    30.4, 65.1]
y = [54.5, 71.2, 87.4, 50.3, -4.8, 48.2, 64.2, 61.7, 118.2, 44.8, 81.9, 86.6,
    85.2, 88.2, 34.6, 80.9, 106.6, 105.3, 64.8, 109.3, 49.7, 81.1, 15.1, 36.0,
    34.5, 102.7, 44.3, 57.6, 82.5, 102.5, 78.7, 81.8, 77.5, 109.7, 43.7, 41.8,
    59.8, 76.6, 32.6, 65.6, 114.0, 26.6, 49.2, 72.7, 80.8, 15.3, 52.3, 78.5,
    110.2, 29.0, 93.1, 82.4, 103.4, 111.9, 78.9, 49.7, 68.2, 88.6, 98.0, 38.9,
    38.5, 23.6, 47.7, 110.7, 46.3, 67.9, 84.4, 18.7, 92.3, 98.1, 33.5, 64.5,
    76.4, 134.8, 46.5, 81.8, 7.9, 95.5, 94.8, 114.1, 39.0, 67.3, 86.6, 74.8,
    73.2, 81.4, 35.2, 61.3, 68.6, 115.3, 62.3, 98.0, 71.9, 74.5, 36.5, 55.7,
    54.7, 86.4, 95.6]

import statistics as st
from math import sqrt
from t_crit import getVal
def main(data_x = x,data_y = y, alpha = 0.01):
    X = st.mean(data_x)
    Sx = sqrt(st.variance(data_x,X))
    Y = st.mean(data_y)
    Sy = sqrt(st.variance(data_y,Y))
    nx = len(data_x)
    ny = len(data_y)
    S = sqrt( ((nx-1)*Sx + (ny-1)*Sy)/(nx + ny - 2) )
    t = (X - Y)/(S * sqrt(1/nx + 1/ny))
    t_crit = getVal(alpha/2,nx+ny-2)
    if abs(t) < t_crit:
         print("– нет оснований отвергнуть гипотезу")
    else:
        print("– гипотезу отвергают.")


main()