import statistics as st
from my_methods import GetParm
from math import sqrt
# Задание 5. По данным выборки, удовлетворяющей нормальному закону
# распределения со средним квадратическим отклонением S , вычислить:
# 1) выборочное среднее;
# 2) доверительный интервал для математического ожидания при доверительной вероятности γ.
data = [41.9, 34.5, 38.3, 35.0, 31.0, 38.5, 36.4, 36.8, 38.8, 37.0, 45.4,
    39.3, 46.2, 42.9, 35.0, 36.3, 41.7, 33.6, 37.9, 40.0, 35.9, 43.4,
    43.3, 31.3, 26.9, 40.4, 40.5, 37.9, 32.4, 35.2, 38.4, 38.1, 34.5,
    37.0, 39.8, 33.7, 37.2, 41.1, 37.0, 41.8, 39.0, 42.6, 32.7, 45.3,
    40.9, 37.1, 31.7, 36.2, 35.5, 29.6, 38.3, 42.2, 34.2, 40.5, 28.6,
    32.1, 37.9, 36.2, 43.0, 31.7, 35.4, 32.2, 42.6, 40.1, 35.8, 44.8,
    32.9, 31.4, 41.9, 48.4, 45.0, 38.1, 43.0, 31.1, 42.5, 51.8, 42.3,
    35.2, 38.2, 45.3, 29.9, 34.6, 38.7, 29.0, 31.9, 28.6, 36.6, 37.4,
    32.5, 32.3, 40.2, 40.9, 35.5, 31.6, 39.1, 36.8, 34.9, 41.1, 41.4,
    40.6
]


def main(data = data, y = 0.95, s = 5):
    x = st.mean(data) 
    print(x)
    Gran = GetParm(y/2) * s / sqrt(len(data))
    print("({:.3f};{:.3f})".format(x-Gran,x+Gran))
    
    
main()