'''
Задание 14. По данным двух выборок нормального закона распределения
(первая – с дисперсией S1**2, вторая – с дисперсией S2**2) 
проверить гипотезу о равенстве средних значений при уровне значимости α (при конкурирующей гипотезе об их неравенстве).
В ответе привести:
    1) выборочное среднее для первой выборки;
    2) выборочное среднее для второй выборки;
    3) вычисленное значение критерия;
    4) критическое значение;
    5) вывод о принятии или не принятии гипотезы.
'''

x = [ 31.8, 41.5, 27.5, 48.8, 30.2, 45.9, -5.4, 67.5, 60.7, 22.0, 30.5, 28.5,
    63.5, 61.8, 55.3, 52.4, 53.5, 36.6, 24.9, 21.1, 13.4, 19.9, 20.1, 2.3,
    26.3, 42.7, 30.1, 10.5, 8.0, 36.4, 49.1, 31.1, 22.2, 31.6, 48.6, 72.9, 70.9,
    65.1, 9.0, 46.6, 31.1, 79.8, 44.3, 42.5, 41.8, 57.7, 48.0, 34.5, 26.0, 72.4,
    29.5, 41.8, 78.0, 36.3, 50.3, 94.5, 21.3, 22.9, 0.1, 45.9, 36.4, 71.6,
    101.1, 47.6, 36.6, 44.7, 73.0, 63.7, 33.6, 35.8, 51.1, 47.2, -5.7, 66.8,
    43.0, 51.0, 45.6, 38.6, 24.7, 69.8, 40.3, 59.8, 51.6, 26.9, 9.6, 27.5, 49.6,
    -41.3, 63.5, 57.4, 41.9, 95.5, 71.8, 27.9, 20.3, 13.2, 37.9, 40.0, 78.1]
y = [99.1, 19.4, 97.0, 62.7, 12.2, 11.9, 57.9, 114.3, 92.8, 63.9, 22.5, 92.0, 13.1,
    120.0, 3.6, 105.4, 44.9, 44.2, 68.8, 59.9, 9.7, 17.7, 41.1, 54.8, 19.1, 55.4,
    120.8, 17.8, 4.4, 48.4, 59.6, -14.8, 74.8, 43.8, 6.4, 52.2, -4.9, 50.7, 49.7,
    7.6, -22.3, 109.3, -16.0, 74.6, 28.6, 4.3, 10.8, 31.5, 15.9, 45.2, 31.2, 44.9,
    68.4, 55.7, 17.5, 41.0, 78.5, 48.6, 16.6, 77.1, 47.7, 123.5, 48.0, 42.6, 76.9,
    9.6, 14.9, 17.5, 53.5, 69.5, -2.8, 78.2, 36.7, 91.0, 57.3, 64.0, 50.1, 14.8,
    85.3, 53.9, 5.9, 92.1, 67.7, -2.1, 36.8, 80.7, 55.8, 28.3, 99.1, 89.5, 20.91,
    16.3, 90.4, 89.9, 113.6, 11.9, 14.4, 55.4, 95.8]

import statistics as st
from math import sqrt
from Function import t_crit as Table
def main(data_x = x,data_y = y, alpha = 0.01):
    X = st.mean(data_x)
    print(X)
    Sx = sqrt(st.variance(data_x,X))
    Y = st.mean(data_y)
    print(Y)
    Sy = sqrt(st.variance(data_y,Y))
    nx = len(data_x)
    ny = len(data_y)
    S = sqrt( ((nx-1)*Sx + (ny-1)*Sy)/(nx + ny - 2) )
    t = (X - Y)/(S * sqrt(1/nx + 1/ny))
    print(t)
    t_crit = Table.getVal(alpha/2,nx+ny-2)
    print(t_crit)
    print((nx + ny - 2))
    if abs(t) < t_crit:
         print("– нет оснований отвергнуть гипотезу")
    else:
        print("– гипотезу отвергают.")


main()